%cityXY = rand(2, 31);
%x = TSPSA(cityXY, 100, 0.5, 4000, 20);

%cityXY = rand(2, 51);
%x = TSPSA(cityXY, 100, 0.5, 4000, 20);

%cityXY = rand(2, 71);
%x = TSPSA(cityXY, 100, 0.5, 4000, 20);

%cityXY = rand(2, 101);
%x = TSPSA(cityXY, 100, 0.5, 4000, 20);

%cityXY = rand(2, 101);
%x = TSPSA(cityXY, 100, 0.5, 4000, 40);

x = TSPSA(cityXY, 600, 0.97, 4000, 600);

hold off;
plotcities(x);

% x,0.5,1000,500
%(300,8.3121)(500,8.8531)(600,8.2670)(2000,8.2496)

% 600,x,2000,500
%(0.6,8.0674)(0.96,8.0644)

% 600,0.95,4000,x
% (500,7.9782)

% 600, 0.97, 4000, 600   7.9568

% 初始温度，冷却率，最大迭代次数，逆转城市数
% 初始温度要大100~2000
% 冷却率：接近1的时候会提前停止，较小容易陷入局部最优解
% 合适的链长度：100n